app/controllers/movies_controller.rb

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 7]]
UPDATE "movies" SET "title" = ?, "rating" = ?, "director" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["title", "FGH"], ["rating", "R"], ["director", "Director21"], ["updated_at", "2018-10-08 16:32:52.273700"], ["id", 13]]
---
  def update
    @movie = Movie.find params[:id]
    @movie.update_attributes!(movie_params)

SELECT "movies".* FROM "movies"
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", nil]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" IS NULL
---
  def find_movies_by_director
    @movies= Movie.all
    @movie = Movie.find (params[:title])
    @similar_movies = Movie.find_by_director(@movie.director)